app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums"
---
  def index
    @forums = Forum.all

INSERT INTO "forums" ("created_at", "description", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2016-01-12 09:32:35.372356"], ["description", "Test Description"], ["title", "ABC"], ["updated_at", "2016-01-12 09:32:35.372356"]]
---
  def create
    @forum = Forum.new(forum_params)

    respond_to do |format|
      if @forum.save

UPDATE "forums" SET "title" = $1, "updated_at" = $2 WHERE "forums"."id" = 1  [["title", "ABCD"], ["updated_at", "2016-01-12 10:09:11.197279"]]
---
  def update
    respond_to do |format|
      if @forum.update(forum_params)

DELETE FROM "forums" WHERE "forums"."id" = $1  [["id", 1]]
---
  def destroy
    @forum.destroy

SELECT  "forums".* FROM "forums"  WHERE "forums"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_forum
      @forum = Forum.find(params[:id])