app/controllers/tenants_controller.rb

SELECT "tenants".* FROM "tenants"
---
  def index
    @tenants = Tenant.all

INSERT INTO "tenants" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2016-07-20 11:25:21.163134"], ["name", "aa"], ["updated_at", "2016-07-20 11:25:21.163134"]]
---
  def create
    @tenant = Tenant.new(tenant_params)
    respond_to do |format|
      if @tenant.save

DELETE FROM "tenants" WHERE "tenants"."id" = $1  [["id", 1]]
---
  def destroy
    @tenant.destroy

SELECT  "tenants".* FROM "tenants"  WHERE "tenants"."id" = $1 LIMIT 1  [["id", 4]]
---
    def set_tenant
      @tenant = Tenant.find(params[:id])